wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_exti.h
/***********************************************************************************************************************
    @file     reg_exti.h
    @author   VV TEAM
    @brief    This flie contains all the EXTI's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_EXTI_H
#define __REG_EXTI_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"

/**
  * @brief EXTI Base Address Definition
  */
#define  EXTI_BASE                                 0x40010400 /*!<Base Address: 0x40010400*/

/**
  * @brief EXTI Register Structure Definition
  */
typedef struct
{
    __IO uint32_t IMR;                 /*!<EXTI Interrupt mask register                   offset: 0x00*/
    __IO uint32_t EMR;                 /*!<EXTI Event mask register                       offset: 0x04*/
    __IO uint32_t RTSR;                /*!<EXTI Rising edge trigger selection register    offset: 0x08*/
    __IO uint32_t FTSR;                /*!<EXTI Falling edge trigger selection register   offset: 0x0C*/
    __IO uint32_t SWIER;               /*!<EXTI Software interrupt event register         offset: 0x10*/
    __IO uint32_t PR;                  /*!<EXTI Pending register                          offset: 0x14*/
} EXTI_TypeDef;

/**
  * @brief EXTI type pointer Definition
  */
#define EXTI                                      ((EXTI_TypeDef *)EXTI_BASE)

/**
  * @brief EXTI_IMR Register Bit Definition
  */
#define EXTI_IMR_IMR0_Pos                         (0)
#define EXTI_IMR_IMR0                             (0x01U << EXTI_IMR_IMR0_Pos)  /*!< Interrupt Mask on line 0 */
#define EXTI_IMR_IMR1_Pos                         (1)
#define EXTI_IMR_IMR1                             (0x01U << EXTI_IMR_IMR1_Pos)  /*!< Interrupt Mask on line 1 */
#define EXTI_IMR_IMR2_Pos                         (2)
#define EXTI_IMR_IMR2                             (0x01U << EXTI_IMR_IMR2_Pos)  /*!< Interrupt Mask on line 2 */
#define EXTI_IMR_IMR3_Pos                         (3)
#define EXTI_IMR_IMR3                             (0x01U << EXTI_IMR_IMR3_Pos)  /*!< Interrupt Mask on line 3 */
#define EXTI_IMR_IMR4_Pos                         (4)
#define EXTI_IMR_IMR4                             (0x01U << EXTI_IMR_IMR4_Pos)  /*!< Interrupt Mask on line 4 */
#define EXTI_IMR_IMR5_Pos                         (5)
#define EXTI_IMR_IMR5                             (0x01U << EXTI_IMR_IMR5_Pos)  /*!< Interrupt Mask on line 5 */
#define EXTI_IMR_IMR6_Pos                         (6)
#define EXTI_IMR_IMR6                             (0x01U << EXTI_IMR_IMR6_Pos)  /*!< Interrupt Mask on line 6 */
#define EXTI_IMR_IMR7_Pos                         (7)
#define EXTI_IMR_IMR7                             (0x01U << EXTI_IMR_IMR7_Pos)  /*!< Interrupt Mask on line 7 */
#define EXTI_IMR_IMR8_Pos                         (8)
#define EXTI_IMR_IMR8                             (0x01U << EXTI_IMR_IMR8_Pos)  /*!< Interrupt Mask on line 8 */
#define EXTI_IMR_IMR9_Pos                         (9)
#define EXTI_IMR_IMR9                             (0x01U << EXTI_IMR_IMR9_Pos)  /*!< Interrupt Mask on line 9 */
#define EXTI_IMR_IMR10_Pos                        (10)
#define EXTI_IMR_IMR10                            (0x01U << EXTI_IMR_IMR10_Pos) /*!< Interrupt Mask on line 10 */
#define EXTI_IMR_IMR11_Pos                        (11)
#define EXTI_IMR_IMR11                            (0x01U << EXTI_IMR_IMR11_Pos) /*!< Interrupt Mask on line 11 */
#define EXTI_IMR_IMR12_Pos                        (12)
#define EXTI_IMR_IMR12                            (0x01U << EXTI_IMR_IMR12_Pos) /*!< Interrupt Mask on line 12 */
#define EXTI_IMR_IMR13_Pos                        (13)
#define EXTI_IMR_IMR13                            (0x01U << EXTI_IMR_IMR13_Pos) /*!< Interrupt Mask on line 13 */
#define EXTI_IMR_IMR14_Pos                        (14)
#define EXTI_IMR_IMR14                            (0x01U << EXTI_IMR_IMR14_Pos) /*!< Interrupt Mask on line 14 */
#define EXTI_IMR_IMR15_Pos                        (15)
#define EXTI_IMR_IMR15                            (0x01U << EXTI_IMR_IMR15_Pos) /*!< Interrupt Mask on line 15 */
#define EXTI_IMR_IMR16_Pos                        (16)
#define EXTI_IMR_IMR16                            (0x01U << EXTI_IMR_IMR16_Pos) /*!< Interrupt Mask on line 16 */
#define EXTI_IMR_IMR17_Pos                        (17)
#define EXTI_IMR_IMR17                            (0x01U << EXTI_IMR_IMR17_Pos) /*!< Interrupt Mask on line 17 */
#define EXTI_IMR_IMR18_Pos                        (18)
#define EXTI_IMR_IMR18                            (0x01U << EXTI_IMR_IMR18_Pos) /*!< Interrupt Mask on line 18 */
#define EXTI_IMR_IMR19_Pos                        (19)
#define EXTI_IMR_IMR19                            (0x01U << EXTI_IMR_IMR19_Pos) /*!< Interrupt Mask on line 19 */
#define EXTI_IMR_IMR20_Pos                        (20)
#define EXTI_IMR_IMR20                            (0x01U << EXTI_IMR_IMR20_Pos) /*!< Interrupt Mask on line 20 */
#define EXTI_IMR_IMR21_Pos                        (21)
#define EXTI_IMR_IMR21                            (0x01U << EXTI_IMR_IMR21_Pos) /*!< Interrupt Mask on line 21 */
#define EXTI_IMR_IMR22_Pos                        (22)
#define EXTI_IMR_IMR22                            (0x01U << EXTI_IMR_IMR22_Pos) /*!< Interrupt Mask on line 22 */
#define EXTI_IMR_IMR23_Pos                        (23)
#define EXTI_IMR_IMR23                            (0x01U << EXTI_IMR_IMR23_Pos) /*!< Interrupt Mask on line 23 */
#define EXTI_IMR_IMR24_Pos                        (24)
#define EXTI_IMR_IMR24                            (0x01U << EXTI_IMR_IMR24_Pos) /*!< Interrupt Mask on line 24 */
#define EXTI_IMR_IMR25_Pos                        (25)
#define EXTI_IMR_IMR25                            (0x01U << EXTI_IMR_IMR25_Pos) /*!< Interrupt Mask on line 25 */
#define EXTI_IMR_IMR26_Pos                        (26)
#define EXTI_IMR_IMR26                            (0x01U << EXTI_IMR_IMR26_Pos) /*!< Interrupt Mask on line 26 */
#define EXTI_IMR_IMR27_Pos                        (27)
#define EXTI_IMR_IMR27                            (0x01U << EXTI_IMR_IMR27_Pos) /*!< Interrupt Mask on line 27 */
#define EXTI_IMR_IMR28_Pos                        (28)
#define EXTI_IMR_IMR28                            (0x01U << EXTI_IMR_IMR28_Pos) /*!< Interrupt Mask on line 28 */
#define EXTI_IMR_IMR29_Pos                        (29)
#define EXTI_IMR_IMR29                            (0x01U << EXTI_IMR_IMR29_Pos) /*!< Interrupt Mask on line 29 */
#define EXTI_IMR_IMR30_Pos                        (30)
#define EXTI_IMR_IMR30                            (0x01U << EXTI_IMR_IMR30_Pos) /*!< Interrupt Mask on line 30 */
#define EXTI_IMR_IMR31_Pos                        (31)
#define EXTI_IMR_IMR31                            (0x01U << EXTI_IMR_IMR31_Pos) /*!< Interrupt Mask on line 31 */

/**
  * @brief EXTI_EMR Register Bit Definition
  */
#define EXTI_EMR_IMR0_Pos                         (0)
#define EXTI_EMR_IMR0                             (0x01U << EXTI_EMR_IMR0_Pos)  /*!< Event Mask on line 0 */
#define EXTI_EMR_IMR1_Pos                         (1)
#define EXTI_EMR_IMR1                             (0x01U << EXTI_EMR_IMR1_Pos)  /*!< Event Mask on line 1 */
#define EXTI_EMR_IMR2_Pos                         (2)
#define EXTI_EMR_IMR2                             (0x01U << EXTI_EMR_IMR2_Pos)  /*!< Event Mask on line 2 */
#define EXTI_EMR_IMR3_Pos                         (3)
#define EXTI_EMR_IMR3                             (0x01U << EXTI_EMR_IMR3_Pos)  /*!< Event Mask on line 3 */
#define EXTI_EMR_IMR4_Pos                         (4)
#define EXTI_EMR_IMR4                             (0x01U << EXTI_EMR_IMR4_Pos)  /*!< Event Mask on line 4 */
#define EXTI_EMR_IMR5_Pos                         (5)
#define EXTI_EMR_IMR5                             (0x01U << EXTI_EMR_IMR5_Pos)  /*!< Event Mask on line 5 */
#define EXTI_EMR_IMR6_Pos                         (6)
#define EXTI_EMR_IMR6                             (0x01U << EXTI_EMR_IMR6_Pos)  /*!< Event Mask on line 6 */
#define EXTI_EMR_IMR7_Pos                         (7)
#define EXTI_EMR_IMR7                             (0x01U << EXTI_EMR_IMR7_Pos)  /*!< Event Mask on line 7 */
#define EXTI_EMR_IMR8_Pos                         (8)
#define EXTI_EMR_IMR8                             (0x01U << EXTI_EMR_IMR8_Pos)  /*!< Event Mask on line 8 */
#define EXTI_EMR_IMR9_Pos                         (9)
#define EXTI_EMR_IMR9                             (0x01U << EXTI_EMR_IMR9_Pos)  /*!< Event Mask on line 9 */
#define EXTI_EMR_IMR10_Pos                        (10)
#define EXTI_EMR_IMR10                            (0x01U << EXTI_EMR_IMR10_Pos) /*!< Event Mask on line 10 */
#define EXTI_EMR_IMR11_Pos                        (11)
#define EXTI_EMR_IMR11                            (0x01U << EXTI_EMR_IMR11_Pos) /*!< Event Mask on line 11 */
#define EXTI_EMR_IMR12_Pos                        (12)
#define EXTI_EMR_IMR12                            (0x01U << EXTI_EMR_IMR12_Pos) /*!< Event Mask on line 12 */
#define EXTI_EMR_IMR13_Pos                        (13)
#define EXTI_EMR_IMR13                            (0x01U << EXTI_EMR_IMR13_Pos) /*!< Event Mask on line 13 */
#define EXTI_EMR_IMR14_Pos                        (14)
#define EXTI_EMR_IMR14                            (0x01U << EXTI_EMR_IMR14_Pos) /*!< Event Mask on line 14 */
#define EXTI_EMR_IMR15_Pos                        (15)
#define EXTI_EMR_IMR15                            (0x01U << EXTI_EMR_IMR15_Pos) /*!< Event Mask on line 15 */
#define EXTI_EMR_IMR16_Pos                        (16)
#define EXTI_EMR_IMR16                            (0x01U << EXTI_EMR_IMR16_Pos) /*!< Event Mask on line 16 */
#define EXTI_EMR_IMR17_Pos                        (17)
#define EXTI_EMR_IMR17                            (0x01U << EXTI_EMR_IMR17_Pos) /*!< Event Mask on line 17 */
#define EXTI_EMR_IMR18_Pos                        (18)
#define EXTI_EMR_IMR18                            (0x01U << EXTI_EMR_IMR18_Pos) /*!< Event Mask on line 18 */
#define EXTI_EMR_IMR19_Pos                        (19)
#define EXTI_EMR_IMR19                            (0x01U << EXTI_EMR_IMR19_Pos) /*!< Event Mask on line 19 */
#define EXTI_EMR_IMR20_Pos                        (20)
#define EXTI_EMR_IMR20                            (0x01U << EXTI_EMR_IMR20_Pos) /*!< Event Mask on line 20 */
#define EXTI_EMR_IMR21_Pos                        (21)
#define EXTI_EMR_IMR21                            (0x01U << EXTI_EMR_IMR21_Pos) /*!< Event Mask on line 21 */
#define EXTI_EMR_IMR22_Pos                        (22)
#define EXTI_EMR_IMR22                            (0x01U << EXTI_EMR_IMR22_Pos) /*!< Event Mask on line 22 */
#define EXTI_EMR_IMR23_Pos                        (23)
#define EXTI_EMR_IMR23                            (0x01U << EXTI_EMR_IMR23_Pos) /*!< Event Mask on line 23 */
#define EXTI_EMR_IMR24_Pos                        (24)
#define EXTI_EMR_IMR24                            (0x01U << EXTI_EMR_IMR24_Pos) /*!< Event Mask on line 24 */
#define EXTI_EMR_IMR25_Pos                        (25)
#define EXTI_EMR_IMR25                            (0x01U << EXTI_EMR_IMR25_Pos) /*!< Event Mask on line 25 */
#define EXTI_EMR_IMR26_Pos                        (26)
#define EXTI_EMR_IMR26                            (0x01U << EXTI_EMR_IMR26_Pos) /*!< Event Mask on line 26 */
#define EXTI_EMR_IMR27_Pos                        (27)
#define EXTI_EMR_IMR27                            (0x01U << EXTI_EMR_IMR27_Pos) /*!< Event Mask on line 27 */
#define EXTI_EMR_IMR28_Pos                        (28)
#define EXTI_EMR_IMR28                            (0x01U << EXTI_EMR_IMR28_Pos) /*!< Event Mask on line 28 */
#define EXTI_EMR_IMR29_Pos                        (29)
#define EXTI_EMR_IMR29                            (0x01U << EXTI_EMR_IMR29_Pos) /*!< Event Mask on line 29 */
#define EXTI_EMR_IMR30_Pos                        (30)
#define EXTI_EMR_IMR30                            (0x01U << EXTI_EMR_IMR30_Pos) /*!< Event Mask on line 30 */
#define EXTI_EMR_IMR31_Pos                        (31)
#define EXTI_EMR_IMR31                            (0x01U << EXTI_EMR_IMR31_Pos) /*!< Event Mask on line 31 */

/**
  * @brief EXTI_RTSR Register Bit Definition
  */
#define EXTI_RTSR_TR0_Pos                         (0)
#define EXTI_RTSR_TR0                             (0x01U << EXTI_RTSR_TR0_Pos)  /*!< Rising trigger event configuration bit of line 0 */
#define EXTI_RTSR_TR1_Pos                         (1)
#define EXTI_RTSR_TR1                             (0x01U << EXTI_RTSR_TR1_Pos)  /*!< Rising trigger event configuration bit of line 1 */
#define EXTI_RTSR_TR2_Pos                         (2)
#define EXTI_RTSR_TR2                             (0x01U << EXTI_RTSR_TR2_Pos)  /*!< Rising trigger event configuration bit of line 2 */
#define EXTI_RTSR_TR3_Pos                         (3)
#define EXTI_RTSR_TR3                             (0x01U << EXTI_RTSR_TR3_Pos)  /*!< Rising trigger event configuration bit of line 3 */
#define EXTI_RTSR_TR4_Pos                         (4)
#define EXTI_RTSR_TR4                             (0x01U << EXTI_RTSR_TR4_Pos)  /*!< Rising trigger event configuration bit of line 4 */
#define EXTI_RTSR_TR5_Pos                         (5)
#define EXTI_RTSR_TR5                             (0x01U << EXTI_RTSR_TR5_Pos)  /*!< Rising trigger event configuration bit of line 5 */
#define EXTI_RTSR_TR6_Pos                         (6)
#define EXTI_RTSR_TR6                             (0x01U << EXTI_RTSR_TR6_Pos)  /*!< Rising trigger event configuration bit of line 6 */
#define EXTI_RTSR_TR7_Pos                         (7)
#define EXTI_RTSR_TR7                             (0x01U << EXTI_RTSR_TR7_Pos)  /*!< Rising trigger event configuration bit of line 7 */
#define EXTI_RTSR_TR8_Pos                         (8)
#define EXTI_RTSR_TR8                             (0x01U << EXTI_RTSR_TR8_Pos)  /*!< Rising trigger event configuration bit of line 8 */
#define EXTI_RTSR_TR9_Pos                         (9)
#define EXTI_RTSR_TR9                             (0x01U << EXTI_RTSR_TR9_Pos)  /*!< Rising trigger event configuration bit of line 9 */
#define EXTI_RTSR_TR10_Pos                        (10)
#define EXTI_RTSR_TR10                            (0x01U << EXTI_RTSR_TR10_Pos) /*!< Rising trigger event configuration bit of line 10 */
#define EXTI_RTSR_TR11_Pos                        (11)
#define EXTI_RTSR_TR11                            (0x01U << EXTI_RTSR_TR11_Pos) /*!< Rising trigger event configuration bit of line 11 */
#define EXTI_RTSR_TR12_Pos                        (12)
#define EXTI_RTSR_TR12                            (0x01U << EXTI_RTSR_TR12_Pos) /*!< Rising trigger event configuration bit of line 12 */
#define EXTI_RTSR_TR13_Pos                        (13)
#define EXTI_RTSR_TR13                            (0x01U << EXTI_RTSR_TR13_Pos) /*!< Rising trigger event configuration bit of line 13 */
#define EXTI_RTSR_TR14_Pos                        (14)
#define EXTI_RTSR_TR14                            (0x01U << EXTI_RTSR_TR14_Pos) /*!< Rising trigger event configuration bit of line 14 */
#define EXTI_RTSR_TR15_Pos                        (15)
#define EXTI_RTSR_TR15                            (0x01U << EXTI_RTSR_TR15_Pos) /*!< Rising trigger event configuration bit of line 15 */
#define EXTI_RTSR_TR16_Pos                        (16)
#define EXTI_RTSR_TR16                            (0x01U << EXTI_RTSR_TR16_Pos) /*!< Rising trigger event configuration bit of line 16 */
#define EXTI_RTSR_TR17_Pos                        (17)
#define EXTI_RTSR_TR17                            (0x01U << EXTI_RTSR_TR17_Pos) /*!< Rising trigger event configuration bit of line 17 */
#define EXTI_RTSR_TR18_Pos                        (18)
#define EXTI_RTSR_TR18                            (0x01U << EXTI_RTSR_TR18_Pos) /*!< Rising trigger event configuration bit of line 18 */
#define EXTI_RTSR_TR19_Pos                        (19)
#define EXTI_RTSR_TR19                            (0x01U << EXTI_RTSR_TR19_Pos) /*!< Rising trigger event configuration bit of line 19 */
#define EXTI_RTSR_TR20_Pos                        (20)
#define EXTI_RTSR_TR20                            (0x01U << EXTI_RTSR_TR20_Pos) /*!< Rising trigger event configuration bit of line 20 */
#define EXTI_RTSR_TR21_Pos                        (21)
#define EXTI_RTSR_TR21                            (0x01U << EXTI_RTSR_TR21_Pos) /*!< Rising trigger event configuration bit of line 21 */
#define EXTI_RTSR_TR22_Pos                        (22)
#define EXTI_RTSR_TR22                            (0x01U << EXTI_RTSR_TR22_Pos) /*!< Rising trigger event configuration bit of line 22 */
#define EXTI_RTSR_TR23_Pos                        (23)
#define EXTI_RTSR_TR23                            (0x01U << EXTI_RTSR_TR23_Pos) /*!< Rising trigger event configuration bit of line 23 */
#define EXTI_RTSR_TR24_Pos                        (24)
#define EXTI_RTSR_TR24                            (0x01U << EXTI_RTSR_TR24_Pos) /*!< Rising trigger event configuration bit of line 24 */
#define EXTI_RTSR_TR25_Pos                        (25)
#define EXTI_RTSR_TR25                            (0x01U << EXTI_RTSR_TR25_Pos) /*!< Rising trigger event configuration bit of line 25 */
#define EXTI_RTSR_TR26_Pos                        (26)
#define EXTI_RTSR_TR26                            (0x01U << EXTI_RTSR_TR26_Pos) /*!< Rising trigger event configuration bit of line 26 */
#define EXTI_RTSR_TR27_Pos                        (27)
#define EXTI_RTSR_TR27                            (0x01U << EXTI_RTSR_TR27_Pos) /*!< Rising trigger event configuration bit of line 27 */
#define EXTI_RTSR_TR28_Pos                        (28)
#define EXTI_RTSR_TR28                            (0x01U << EXTI_RTSR_TR28_Pos) /*!< Rising trigger event configuration bit of line 28 */
#define EXTI_RTSR_TR29_Pos                        (29)
#define EXTI_RTSR_TR29                            (0x01U << EXTI_RTSR_TR29_Pos) /*!< Rising trigger event configuration bit of line 29 */
#define EXTI_RTSR_TR30_Pos                        (30)
#define EXTI_RTSR_TR30                            (0x01U << EXTI_RTSR_TR30_Pos) /*!< Rising trigger event configuration bit of line 30 */
#define EXTI_RTSR_TR31_Pos                        (31)
#define EXTI_RTSR_TR31                            (0x01U << EXTI_RTSR_TR31_Pos) /*!< Rising trigger event configuration bit of line 31 */

