wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_exti.h
/**
  * @brief EXTI_FTSR Register Bit Definition
  */
#define EXTI_FTSR_TR0_Pos                         (0)
#define EXTI_FTSR_TR0                             (0x01U << EXTI_FTSR_TR0_Pos)  /*!< Falling trigger event configuration bit of line 0 */
#define EXTI_FTSR_TR1_Pos                         (1)
#define EXTI_FTSR_TR1                             (0x01U << EXTI_FTSR_TR1_Pos)  /*!< Falling trigger event configuration bit of line 1 */
#define EXTI_FTSR_TR2_Pos                         (2)
#define EXTI_FTSR_TR2                             (0x01U << EXTI_FTSR_TR2_Pos)  /*!< Falling trigger event configuration bit of line 2 */
#define EXTI_FTSR_TR3_Pos                         (3)
#define EXTI_FTSR_TR3                             (0x01U << EXTI_FTSR_TR3_Pos)  /*!< Falling trigger event configuration bit of line 3 */
#define EXTI_FTSR_TR4_Pos                         (4)
#define EXTI_FTSR_TR4                             (0x01U << EXTI_FTSR_TR4_Pos)  /*!< Falling trigger event configuration bit of line 4 */
#define EXTI_FTSR_TR5_Pos                         (5)
#define EXTI_FTSR_TR5                             (0x01U << EXTI_FTSR_TR5_Pos)  /*!< Falling trigger event configuration bit of line 5 */
#define EXTI_FTSR_TR6_Pos                         (6)
#define EXTI_FTSR_TR6                             (0x01U << EXTI_FTSR_TR6_Pos)  /*!< Falling trigger event configuration bit of line 6 */
#define EXTI_FTSR_TR7_Pos                         (7)
#define EXTI_FTSR_TR7                             (0x01U << EXTI_FTSR_TR7_Pos)  /*!< Falling trigger event configuration bit of line 7 */
#define EXTI_FTSR_TR8_Pos                         (8)
#define EXTI_FTSR_TR8                             (0x01U << EXTI_FTSR_TR8_Pos)  /*!< Falling trigger event configuration bit of line 8 */
#define EXTI_FTSR_TR9_Pos                         (9)
#define EXTI_FTSR_TR9                             (0x01U << EXTI_FTSR_TR9_Pos)  /*!< Falling trigger event configuration bit of line 9 */
#define EXTI_FTSR_TR10_Pos                        (10)
#define EXTI_FTSR_TR10                            (0x01U << EXTI_FTSR_TR10_Pos) /*!< Falling trigger event configuration bit of line 10 */
#define EXTI_FTSR_TR11_Pos                        (11)
#define EXTI_FTSR_TR11                            (0x01U << EXTI_FTSR_TR11_Pos) /*!< Falling trigger event configuration bit of line 11 */
#define EXTI_FTSR_TR12_Pos                        (12)
#define EXTI_FTSR_TR12                            (0x01U << EXTI_FTSR_TR12_Pos) /*!< Falling trigger event configuration bit of line 12 */
#define EXTI_FTSR_TR13_Pos                        (13)
#define EXTI_FTSR_TR13                            (0x01U << EXTI_FTSR_TR13_Pos) /*!< Falling trigger event configuration bit of line 13 */
#define EXTI_FTSR_TR14_Pos                        (14)
#define EXTI_FTSR_TR14                            (0x01U << EXTI_FTSR_TR14_Pos) /*!< Falling trigger event configuration bit of line 14 */
#define EXTI_FTSR_TR15_Pos                        (15)
#define EXTI_FTSR_TR15                            (0x01U << EXTI_FTSR_TR15_Pos) /*!< Falling trigger event configuration bit of line 15 */
#define EXTI_FTSR_TR16_Pos                        (16)
#define EXTI_FTSR_TR16                            (0x01U << EXTI_FTSR_TR16_Pos) /*!< Falling trigger event configuration bit of line 16 */
#define EXTI_FTSR_TR17_Pos                        (17)
#define EXTI_FTSR_TR17                            (0x01U << EXTI_FTSR_TR17_Pos) /*!< Falling trigger event configuration bit of line 17 */
#define EXTI_FTSR_TR18_Pos                        (18)
#define EXTI_FTSR_TR18                            (0x01U << EXTI_FTSR_TR18_Pos) /*!< Falling trigger event configuration bit of line 18 */
#define EXTI_FTSR_TR19_Pos                        (19)
#define EXTI_FTSR_TR19                            (0x01U << EXTI_FTSR_TR19_Pos) /*!< Falling trigger event configuration bit of line 19 */
#define EXTI_FTSR_TR20_Pos                        (20)
#define EXTI_FTSR_TR20                            (0x01U << EXTI_FTSR_TR20_Pos) /*!< Falling trigger event configuration bit of line 20 */
#define EXTI_FTSR_TR21_Pos                        (21)
#define EXTI_FTSR_TR21                            (0x01U << EXTI_FTSR_TR21_Pos) /*!< Falling trigger event configuration bit of line 21 */
#define EXTI_FTSR_TR22_Pos                        (22)
#define EXTI_FTSR_TR22                            (0x01U << EXTI_FTSR_TR22_Pos) /*!< Falling trigger event configuration bit of line 22 */
#define EXTI_FTSR_TR23_Pos                        (23)
#define EXTI_FTSR_TR23                            (0x01U << EXTI_FTSR_TR23_Pos) /*!< Falling trigger event configuration bit of line 23 */
#define EXTI_FTSR_TR24_Pos                        (24)
#define EXTI_FTSR_TR24                            (0x01U << EXTI_FTSR_TR24_Pos) /*!< Falling trigger event configuration bit of line 24 */
#define EXTI_FTSR_TR25_Pos                        (25)
#define EXTI_FTSR_TR25                            (0x01U << EXTI_FTSR_TR25_Pos) /*!< Falling trigger event configuration bit of line 25 */
#define EXTI_FTSR_TR26_Pos                        (26)
#define EXTI_FTSR_TR26                            (0x01U << EXTI_FTSR_TR26_Pos) /*!< Falling trigger event configuration bit of line 26 */
#define EXTI_FTSR_TR27_Pos                        (27)
#define EXTI_FTSR_TR27                            (0x01U << EXTI_FTSR_TR27_Pos) /*!< Falling trigger event configuration bit of line 27 */
#define EXTI_FTSR_TR28_Pos                        (28)
#define EXTI_FTSR_TR28                            (0x01U << EXTI_FTSR_TR28_Pos) /*!< Falling trigger event configuration bit of line 28 */
#define EXTI_FTSR_TR29_Pos                        (29)
#define EXTI_FTSR_TR29                            (0x01U << EXTI_FTSR_TR29_Pos) /*!< Falling trigger event configuration bit of line 29 */
#define EXTI_FTSR_TR30_Pos                        (30)
#define EXTI_FTSR_TR30                            (0x01U << EXTI_FTSR_TR30_Pos) /*!< Falling trigger event configuration bit of line 30 */
#define EXTI_FTSR_TR31_Pos                        (31)
#define EXTI_FTSR_TR31                            (0x01U << EXTI_FTSR_TR31_Pos) /*!< Falling trigger event configuration bit of line 31 */

/**
  * @brief EXTI_SWIER Register Bit Definition
  */
#define EXTI_SWIER_SWIER0_Pos                     (0)
#define EXTI_SWIER_SWIER0                         (0x01U << EXTI_SWIER_SWIER0_Pos)  /*!< Software Interrupt on line  0 */
#define EXTI_SWIER_SWIER1_Pos                     (1)
#define EXTI_SWIER_SWIER1                         (0x01U << EXTI_SWIER_SWIER1_Pos)  /*!< Software Interrupt on line  1 */
#define EXTI_SWIER_SWIER2_Pos                     (2)
#define EXTI_SWIER_SWIER2                         (0x01U << EXTI_SWIER_SWIER2_Pos)  /*!< Software Interrupt on line  2 */
#define EXTI_SWIER_SWIER3_Pos                     (3)
#define EXTI_SWIER_SWIER3                         (0x01U << EXTI_SWIER_SWIER3_Pos)  /*!< Software Interrupt on line  3 */
#define EXTI_SWIER_SWIER4_Pos                     (4)
#define EXTI_SWIER_SWIER4                         (0x01U << EXTI_SWIER_SWIER4_Pos)  /*!< Software Interrupt on line  4 */
#define EXTI_SWIER_SWIER5_Pos                     (5)
#define EXTI_SWIER_SWIER5                         (0x01U << EXTI_SWIER_SWIER5_Pos)  /*!< Software Interrupt on line  5 */
#define EXTI_SWIER_SWIER6_Pos                     (6)
#define EXTI_SWIER_SWIER6                         (0x01U << EXTI_SWIER_SWIER6_Pos)  /*!< Software Interrupt on line  6 */
#define EXTI_SWIER_SWIER7_Pos                     (7)
#define EXTI_SWIER_SWIER7                         (0x01U << EXTI_SWIER_SWIER7_Pos)  /*!< Software Interrupt on line  7 */
#define EXTI_SWIER_SWIER8_Pos                     (8)
#define EXTI_SWIER_SWIER8                         (0x01U << EXTI_SWIER_SWIER8_Pos)  /*!< Software Interrupt on line  8 */
#define EXTI_SWIER_SWIER9_Pos                     (9)
#define EXTI_SWIER_SWIER9                         (0x01U << EXTI_SWIER_SWIER9_Pos)  /*!< Software Interrupt on line  9 */
#define EXTI_SWIER_SWIER10_Pos                    (10)
#define EXTI_SWIER_SWIER10                        (0x01U << EXTI_SWIER_SWIER10_Pos) /*!< Software Interrupt on line  10 */
#define EXTI_SWIER_SWIER11_Pos                    (11)
#define EXTI_SWIER_SWIER11                        (0x01U << EXTI_SWIER_SWIER11_Pos) /*!< Software Interrupt on line  11 */
#define EXTI_SWIER_SWIER12_Pos                    (12)
#define EXTI_SWIER_SWIER12                        (0x01U << EXTI_SWIER_SWIER12_Pos) /*!< Software Interrupt on line  12 */
#define EXTI_SWIER_SWIER13_Pos                    (13)
#define EXTI_SWIER_SWIER13                        (0x01U << EXTI_SWIER_SWIER13_Pos) /*!< Software Interrupt on line  13 */
#define EXTI_SWIER_SWIER14_Pos                    (14)
#define EXTI_SWIER_SWIER14                        (0x01U << EXTI_SWIER_SWIER14_Pos) /*!< Software Interrupt on line  14 */
#define EXTI_SWIER_SWIER15_Pos                    (15)
#define EXTI_SWIER_SWIER15                        (0x01U << EXTI_SWIER_SWIER15_Pos) /*!< Software Interrupt on line  15 */
#define EXTI_SWIER_SWIER16_Pos                    (16)
#define EXTI_SWIER_SWIER16                        (0x01U << EXTI_SWIER_SWIER16_Pos) /*!< Software Interrupt on line  16 */
#define EXTI_SWIER_SWIER17_Pos                    (17)
#define EXTI_SWIER_SWIER17                        (0x01U << EXTI_SWIER_SWIER17_Pos) /*!< Software Interrupt on line  17 */
#define EXTI_SWIER_SWIER18_Pos                    (18)
#define EXTI_SWIER_SWIER18                        (0x01U << EXTI_SWIER_SWIER18_Pos) /*!< Software Interrupt on line  18 */
#define EXTI_SWIER_SWIER19_Pos                    (19)
#define EXTI_SWIER_SWIER19                        (0x01U << EXTI_SWIER_SWIER19_Pos) /*!< Software Interrupt on line  19 */
#define EXTI_SWIER_SWIER20_Pos                    (20)
#define EXTI_SWIER_SWIER20                        (0x01U << EXTI_SWIER_SWIER20_Pos) /*!< Software Interrupt on line  20 */
#define EXTI_SWIER_SWIER21_Pos                    (21)
#define EXTI_SWIER_SWIER21                        (0x01U << EXTI_SWIER_SWIER21_Pos) /*!< Software Interrupt on line  21 */
#define EXTI_SWIER_SWIER22_Pos                    (22)
#define EXTI_SWIER_SWIER22                        (0x01U << EXTI_SWIER_SWIER22_Pos) /*!< Software Interrupt on line  22 */
#define EXTI_SWIER_SWIER23_Pos                    (23)
#define EXTI_SWIER_SWIER23                        (0x01U << EXTI_SWIER_SWIER23_Pos) /*!< Software Interrupt on line  23 */
#define EXTI_SWIER_SWIER24_Pos                    (24)
#define EXTI_SWIER_SWIER24                        (0x01U << EXTI_SWIER_SWIER24_Pos) /*!< Software Interrupt on line  24 */
#define EXTI_SWIER_SWIER25_Pos                    (25)
#define EXTI_SWIER_SWIER25                        (0x01U << EXTI_SWIER_SWIER25_Pos) /*!< Software Interrupt on line  25 */
#define EXTI_SWIER_SWIER26_Pos                    (26)
#define EXTI_SWIER_SWIER26                        (0x01U << EXTI_SWIER_SWIER26_Pos) /*!< Software Interrupt on line  26 */
#define EXTI_SWIER_SWIER27_Pos                    (27)
#define EXTI_SWIER_SWIER27                        (0x01U << EXTI_SWIER_SWIER27_Pos) /*!< Software Interrupt on line  27 */
#define EXTI_SWIER_SWIER28_Pos                    (28)
#define EXTI_SWIER_SWIER28                        (0x01U << EXTI_SWIER_SWIER28_Pos) /*!< Software Interrupt on line  28 */
#define EXTI_SWIER_SWIER29_Pos                    (29)
#define EXTI_SWIER_SWIER29                        (0x01U << EXTI_SWIER_SWIER29_Pos) /*!< Software Interrupt on line  29 */
#define EXTI_SWIER_SWIER30_Pos                    (30)
#define EXTI_SWIER_SWIER30                        (0x01U << EXTI_SWIER_SWIER30_Pos) /*!< Software Interrupt on line  30 */
#define EXTI_SWIER_SWIER31_Pos                    (31)
#define EXTI_SWIER_SWIER31                        (0x01U << EXTI_SWIER_SWIER31_Pos) /*!< Software Interrupt on line  31 */

/**
  * @brief EXTI_PR Register Bit Definition
  */
#define EXTI_PR_PR0_Pos                           (0)
#define EXTI_PR_PR0                               (0x01U << EXTI_PR_PR0_Pos)  /*!< Pending bit 0 */
#define EXTI_PR_PR1_Pos                           (1)
#define EXTI_PR_PR1                               (0x01U << EXTI_PR_PR1_Pos)  /*!< Pending bit 1 */
#define EXTI_PR_PR2_Pos                           (2)
#define EXTI_PR_PR2                               (0x01U << EXTI_PR_PR2_Pos)  /*!< Pending bit 2 */
#define EXTI_PR_PR3_Pos                           (3)
#define EXTI_PR_PR3                               (0x01U << EXTI_PR_PR3_Pos)  /*!< Pending bit 3 */
#define EXTI_PR_PR4_Pos                           (4)
#define EXTI_PR_PR4                               (0x01U << EXTI_PR_PR4_Pos)  /*!< Pending bit 4 */
#define EXTI_PR_PR5_Pos                           (5)
#define EXTI_PR_PR5                               (0x01U << EXTI_PR_PR5_Pos)  /*!< Pending bit 5 */
#define EXTI_PR_PR6_Pos                           (6)
#define EXTI_PR_PR6                               (0x01U << EXTI_PR_PR6_Pos)  /*!< Pending bit 6 */
#define EXTI_PR_PR7_Pos                           (7)
#define EXTI_PR_PR7                               (0x01U << EXTI_PR_PR7_Pos)  /*!< Pending bit 7 */
#define EXTI_PR_PR8_Pos                           (8)
#define EXTI_PR_PR8                               (0x01U << EXTI_PR_PR8_Pos)  /*!< Pending bit 8 */
#define EXTI_PR_PR9_Pos                           (9)
#define EXTI_PR_PR9                               (0x01U << EXTI_PR_PR9_Pos)  /*!< Pending bit 9 */
#define EXTI_PR_PR10_Pos                          (10)
#define EXTI_PR_PR10                              (0x01U << EXTI_PR_PR10_Pos) /*!< Pending bit 10 */
#define EXTI_PR_PR11_Pos                          (11)
#define EXTI_PR_PR11                              (0x01U << EXTI_PR_PR11_Pos) /*!< Pending bit 11 */
#define EXTI_PR_PR12_Pos                          (12)
#define EXTI_PR_PR12                              (0x01U << EXTI_PR_PR12_Pos) /*!< Pending bit 12 */
#define EXTI_PR_PR13_Pos                          (13)
#define EXTI_PR_PR13                              (0x01U << EXTI_PR_PR13_Pos) /*!< Pending bit 13 */
#define EXTI_PR_PR14_Pos                          (14)
#define EXTI_PR_PR14                              (0x01U << EXTI_PR_PR14_Pos) /*!< Pending bit 14 */
#define EXTI_PR_PR15_Pos                          (15)
#define EXTI_PR_PR15                              (0x01U << EXTI_PR_PR15_Pos) /*!< Pending bit 15 */
#define EXTI_PR_PR16_Pos                          (16)
#define EXTI_PR_PR16                              (0x01U << EXTI_PR_PR16_Pos) /*!< Pending bit 16 */
#define EXTI_PR_PR17_Pos                          (17)
#define EXTI_PR_PR17                              (0x01U << EXTI_PR_PR17_Pos) /*!< Pending bit 17 */
#define EXTI_PR_PR18_Pos                          (18)
#define EXTI_PR_PR18                              (0x01U << EXTI_PR_PR18_Pos) /*!< Pending bit 18 */
#define EXTI_PR_PR19_Pos                          (19)
#define EXTI_PR_PR19                              (0x01U << EXTI_PR_PR19_Pos) /*!< Pending bit 19 */
#define EXTI_PR_PR20_Pos                          (20)
#define EXTI_PR_PR20                              (0x01U << EXTI_PR_PR20_Pos) /*!< Pending bit 20 */
#define EXTI_PR_PR21_Pos                          (21)
#define EXTI_PR_PR21                              (0x01U << EXTI_PR_PR21_Pos) /*!< Pending bit 21 */
#define EXTI_PR_PR22_Pos                          (22)
#define EXTI_PR_PR22                              (0x01U << EXTI_PR_PR22_Pos) /*!< Pending bit 22 */
#define EXTI_PR_PR23_Pos                          (23)
#define EXTI_PR_PR23                              (0x01U << EXTI_PR_PR23_Pos) /*!< Pending bit 23 */
#define EXTI_PR_PR24_Pos                          (24)
#define EXTI_PR_PR24                              (0x01U << EXTI_PR_PR24_Pos) /*!< Pending bit 24 */
#define EXTI_PR_PR25_Pos                          (25)
#define EXTI_PR_PR25                              (0x01U << EXTI_PR_PR25_Pos) /*!< Pending bit 25 */
#define EXTI_PR_PR26_Pos                          (26)
#define EXTI_PR_PR26                              (0x01U << EXTI_PR_PR26_Pos) /*!< Pending bit 26 */
#define EXTI_PR_PR27_Pos                          (27)
#define EXTI_PR_PR27                              (0x01U << EXTI_PR_PR27_Pos) /*!< Pending bit 27 */
#define EXTI_PR_PR28_Pos                          (28)
#define EXTI_PR_PR28                              (0x01U << EXTI_PR_PR28_Pos) /*!< Pending bit 28 */
#define EXTI_PR_PR29_Pos                          (29)
#define EXTI_PR_PR29                              (0x01U << EXTI_PR_PR29_Pos) /*!< Pending bit 29 */
#define EXTI_PR_PR30_Pos                          (30)
#define EXTI_PR_PR30                              (0x01U << EXTI_PR_PR30_Pos) /*!< Pending bit 30 */
#define EXTI_PR_PR31_Pos                          (31)
#define EXTI_PR_PR31                              (0x01U << EXTI_PR_PR31_Pos) /*!< Pending bit 31 */

#endif

